tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Software library to render fonts
brew "freetype"
# GitHub command-line tool
brew "gh"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Core application library for C
brew "glib"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Network authentication protocol
brew "krb5"
# Simple terminal UI for git commands
brew "lazygit"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Terminal multiplexer
brew "tmux"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# Manage compile and link flags for libraries
brew "pkg-config"
# Object-relational database system
brew "postgresql@16", restart_service: true
# Service monitoring system and time series database
brew "prometheus"
# Python version management
brew "pyenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Text interface for Git repositories
brew "tig"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
cask "font-fira-code"
# Web browser
cask "google-chrome"
# Keyboard customiser
cask "karabiner-elements"
# Create mock APIs in seconds
cask "mockoon"
# App to write, plan, collaborate, and get organised
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
vscode "ajhyndman.vscode-svgo"
vscode "alefragnani.bookmarks"
vscode "arjun.swagger-viewer"
vscode "asvetliakov.vscode-neovim"
vscode "britesnow.vscode-toggle-quotes"
vscode "carrie999.cyberpunk-2020"
vscode "christian-kohler.path-intellisense"
vscode "circleci.circleci"
vscode "clarkyu.vscode-sql-beautify"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "gitworktrees.git-worktrees"
vscode "hbenl.vscode-test-explorer"
vscode "jack89ita.open-file-from-path"
vscode "kaiwood.endwise"
vscode "koichisasada.vscode-rdbg"
vscode "ldrner.rspec-snippets-vscode"
vscode "lokalise.i18n-ally"
vscode "marcoroth.stimulus-lsp"
vscode "mechatroner.rainbow-csv"
vscode "meezilla.json"
vscode "mikestead.dotenv"
vscode "mohsen1.prettify-json"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "orta.vscode-jest"
vscode "philstainer.git-worktree"
vscode "redhat.vscode-yaml"
vscode "reliablewebhook.reliablewebhook"
vscode "rubocop.vscode-rubocop"
vscode "shanehofstetter.rails-i18n"
vscode "shardulm94.trailing-spaces"
vscode "shopify.ruby-lsp"
vscode "sleistner.vscode-fileutils"
vscode "stylelint.vscode-stylelint"
vscode "thadeu.vscode-run-rspec-file"
vscode "vivaxy.vscode-conventional-commits"
vscode "vortizhe.simple-ruby-erb"
vscode "waderyan.gitblame"
vscode "will-wow.vscode-alternate-file"
vscode "wmaurer.change-case"
vscode "zneuray.erb-vscode-snippets"
